IDEA Open Model
ArcSegment2D.Point Property
Compatible with IDEA StatiCa 20.1
 Gets or sets the point of circular arc somewhere between start and end point.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public Point2D Point { get; set; }
Public Property Point As Point2D
	Get
	Set
Property Value
Type: Point2D
See Also
Reference
ArcSegment2D Class
IdeaRS.OpenModel.Geometry2D Namespace